# Preparing the dataset for exploratory analysis


## To do:
* ~check columns' datatypes~
* ~decide what needs conversion~
* ~decide what should be deleted~
* ~add date column~
* ~add data from Kaggle/London datasets~
* ~add geolocations~
* ~check title column for potential categories~
* ~create final dataset for DA/DS with all columns~
* ~save it to csv and db~

In [1]:
import pandas as pd
from datetime import datetime as dt
import numpy as np
import re
import openpyxl, xlrd

In [2]:
df = pd.read_csv('ldn_properties.csv', index_col=0)
df.head()

,borough,id,address,link,title,num_of_bed,num_of_bath,reception_room,transport_primary,station1_dist(mi),transport_secondary,station2_dist(mi),tag,parking,price
0,city-of-london-london-borough,listing_58614319,"One Crown Place, 54 Wilson Street EC2A",/new-homes/details/58614319/?search_identifier...,1 bed flat for sale,1,1,0,national_rail_station,0.2 miles London Liverpool Street,london_underground_station,0.2 miles Liverpool Street,New home,0,"£1,030,000"
1,city-of-london-london-borough,listing_58614075,"The Barbican, Barbican, London EC2Y",/for-sale/details/58614075/?search_identifier=...,1 bed flat for sale,1,1,1,london_underground_station,0.2 miles Barbican,national_rail_station,0.2 miles Moorgate,New home,0,"£725,000"
2,city-of-london-london-borough,listing_52061413,"Principal Tower, Worship Lane, Shoreditch EC2A",/for-sale/details/52061413/?search_identifier=...,1 bed flat for sale,1,1,1,national_rail_station,0.2 miles Shoreditch High Street,national_rail_station,0.3 miles London Liverpool Street,New home,0,"£875,000"
3,city-of-london-london-borough,listing_55657629,"One Crown Place, Hackney EC2A",/new-homes/details/55657629/?search_identifier...,2 bed flat for sale,2,2,0,national_rail_station,0.2 miles London Liverpool Street,london_underground_station,0.2 miles Liverpool Street,New home,0,"£1,750,000"
4,city-of-london-london-borough,listing_58592857,"Barbican, London EC2Y",/for-sale/details/58592857/?search_identifier=...,Studio for sale,1,1,1,london_underground_station,0 miles Barbican,national_rail_station,0.3 miles Moorgate,New home,0,"£535,000"

In [3]:
df.dtypes

borough                object
id                     object
address                object
link                   object
title                  object
num_of_bed              int64
num_of_bath             int64
reception_room          int64
transport_primary      object
station1_dist(mi)      object
transport_secondary    object
station2_dist(mi)      object
tag                    object
parking                 int64
price                  object
dtype: object

## Typecasting and formatting:

* ~**check for duplicates** - use the id columns~
* ~**check for missing data**~
* ~**price** - delete currency sign and convert it to int~
* ~**station1/2** - extract miles and convert them to floats~
* ~**delete** - link~

In [4]:
# checking for duplicates in id column
df.duplicated(subset='id').sum()

7317

In [5]:
# deleting duplicate listings
df.drop_duplicates('id', keep='first', inplace=True)

In [6]:
df.shape

(63837, 15)

In [7]:
# checking for NaN values
df.isna().sum()

borough                0
id                     0
address                0
link                   0
title                  0
num_of_bed             0
num_of_bath            0
reception_room         0
transport_primary      0
station1_dist(mi)      0
transport_secondary    0
station2_dist(mi)      0
tag                    0
parking                0
price                  0
dtype: int64

In [8]:
# checking for missing values
df.isnull().sum()

borough                0
id                     0
address                0
link                   0
title                  0
num_of_bed             0
num_of_bath            0
reception_room         0
transport_primary      0
station1_dist(mi)      0
transport_secondary    0
station2_dist(mi)      0
tag                    0
parking                0
price                  0
dtype: int64

In [9]:
# checking if price values are digits only
filt = df['price'].str.contains(re.compile(r'(\d),|\d+,\d+'))
df.loc[~filt,'price']

/Users/robertczikkel/anaconda3/lib/python3.8/site-packages/pandas/core/strings.py:2001: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

304      POA
305      POA
595      POA
596      POA
638      POA
        ...
70832    POA
71014    POA
71069    POA
71095    POA
71130    POA
Name: price, Length: 446, dtype: object

There seem to be POA values in the price column, these will be dropped

In [10]:
# deleting rows with no price
df.drop(index=df[df['price'] == 'POA'].index, inplace=True)

In [11]:
df.loc[df['price'] == 'POA']

Empty DataFrame
Columns: [borough, id, address, link, title, num_of_bed, num_of_bath, reception_room, transport_primary, station1_dist(mi), transport_secondary, station2_dist(mi), tag, parking, price]
Index: []

In [12]:
# converting prices to integers
df['price'] = [int(x.replace('£', '').replace(',', '')) for x in df['price']]

In [13]:
df['price'].dtypes

dtype('int64')

In [14]:
# Extracting the distance in miles
df['station1_dist(mi)'] = [float(x.split(' ')[0]) for x in df['station1_dist(mi)']]

In [15]:
df['station1_dist(mi)']

0        0.2
1        0.2
2        0.2
3        0.2
4        0.0
        ...
71146    0.5
71147    0.1
71149    0.1
71150    1.2
71151    1.6
Name: station1_dist(mi), Length: 63391, dtype: float64

In [16]:
df['station2_dist(mi)'] = [float(x.split(' ')[0]) for x in df['station2_dist(mi)']]

In [17]:
df['station2_dist(mi)']

0        0.2
1        0.2
2        0.3
3        0.2
4        0.3
        ...
71146    0.8
71147    1.8
71149    1.8
71150    1.3
71151    1.6
Name: station2_dist(mi), Length: 63391, dtype: float64

In [18]:
del df['link']

In [19]:
df.dtypes

borough                 object
id                      object
address                 object
title                   object
num_of_bed               int64
num_of_bath              int64
reception_room           int64
transport_primary       object
station1_dist(mi)      float64
transport_secondary     object
station2_dist(mi)      float64
tag                     object
parking                  int64
price                    int64
dtype: object

In [20]:
# date of accessing the scraped website (this will be useful in the future for time series analysis if I continue to scrape every month)
df['date'] = dt.now().date()

In [21]:
df['borough']

0        city-of-london-london-borough
1        city-of-london-london-borough
2        city-of-london-london-borough
3        city-of-london-london-borough
4        city-of-london-london-borough
                     ...
71146        hillingdon-london-borough
71147        hillingdon-london-borough
71149        hillingdon-london-borough
71150        hillingdon-london-borough
71151        hillingdon-london-borough
Name: borough, Length: 63391, dtype: object

In [22]:
# reformatting the boroughs - deleting 'london-borough' for better readability 
regex = re.compile(r'-london-borough|-royal-borough')
df['borough'] = [regex.sub('', x) for x in df['borough']]

In [23]:
# replacing the - with space
df['borough'] = [x.replace('-', ' ') for x in df['borough']]
df['borough']

0        city of london
1        city of london
2        city of london
3        city of london
4        city of london
              ...
71146        hillingdon
71147        hillingdon
71149        hillingdon
71150        hillingdon
71151        hillingdon
Name: borough, Length: 63391, dtype: object

In [24]:
# checking for potential extra features to extract from 'title' column
df['title'].unique()

array(['1 bed flat for sale', '2 bed flat for sale', 'Studio for sale',
       '3 bed flat for sale', '3 bed terraced house for sale',
       '1 bed property for sale', 'Parking/garage for sale',
       '4 bed maisonette for sale', 'Property for sale',
       '3 bed semi-detached house for sale', '2 bed property for sale',
       '4 bed terraced house for sale', '4 bed flat for sale',
       '4 bed detached house for sale', '3 bed property for sale',
       '5 bed detached house for sale',
       '7 bed semi-detached house for sale', '3 bed maisonette for sale',
       '3 bed detached house for sale', '12 bed property for sale',
       '2 bed terraced house for sale', '5 bed terraced house for sale',
       '2 bed maisonette for sale', '3 bed end terrace house for sale',
       '6 bed flat for sale', '5 bed flat for sale',
       'Terraced house for sale', '8 bed property for sale',
       'Land for sale', '9 bed detached house for sale',
       '4 bed property for sale', '4 bed semi-detached house for sale',
       '2 bed mews house for sale', '2 bed town house for sale',
       '3 bed mews house for sale', '7 bed flat for sale',
       '6 bed property for sale', '5 bed maisonette for sale',
       '2 bed cottage for sale', '60 bed end terrace house for sale',
       '7 bed detached house for sale', '7 bed terraced house for sale',
       '5 bed property for sale', 'Semi-detached house for sale',
       '6 bed detached house for sale', '1 bed houseboat for sale',
       '5 bed semi-detached house for sale', '3 bed town house for sale',
       '9 bed terraced house for sale', '12 bed terraced house for sale',
       '6 bed terraced house for sale', '5 bed town house for sale',
       '4 bed mobile/park home for sale', '1 bed maisonette for sale',
       '2 bed end terrace house for sale', '4 bed mews house for sale',
       '18 bed property for sale', '5 bed block of flats for sale',
       '11 bed flat for sale', '3 bed penthouse for sale',
       '60 bed town house for sale', '3 bed block of flats for sale',
       '8 bed detached house for sale', '8 bed town house for sale',
       'Block of flats for sale', '4 bed town house for sale',
       '2 bed block of flats for sale', '1 bed terraced house for sale',
       '6 bed semi-detached house for sale',
       '5 bed end terrace house for sale', '7 bed property for sale',
       '60 bed terraced house for sale', '2 bed detached house for sale',
       '8 bed terraced house for sale', '5 bed mews house for sale',
       '60 bed property for sale', '4 bed end terrace house for sale',
       '12 bed town house for sale', '2 bed semi-detached house for sale',
       '10 bed terraced house for sale', 'Town house for sale',
       '1 bed mews house for sale', '8 bed semi-detached house for sale',
       '11 bed detached house for sale', '6 bed town house for sale',
       '3 bed cottage for sale', '2 bed penthouse for sale',
       '1 bed bungalow for sale', '9 bed flat for sale',
       '9 bed semi-detached house for sale', '2 bed bungalow for sale',
       'Maisonette for sale', '3 bed barn conversion for sale',
       '2 bed houseboat for sale', '3 bed houseboat for sale',
       '1 bed semi-detached house for sale', '8 bed mews house for sale',
       '6 bed end terrace house for sale',
       '13 bed terraced house for sale', '11 bed property for sale',
       '6 bed block of flats for sale', '3 bed parking/garage for sale',
       '5 bed houseboat for sale', '6 bed mews house for sale',
       '17 bed property for sale', '7 bed end terrace house for sale',
       '4 bed terraced bungalow for sale', '16 bed property for sale',
       '1 bed detached house for sale', '4 bed houseboat for sale',
       '13 bed flat for sale', '1 bed town house for sale',
       '8 bed flat for sale', '10 bed end terrace house for sale',
       '1 bed end terrace house for sale', '4 bed lodge for sale',
       '2 bed lodge for sale', '7 bed maisonette for sale',
       '2 bed parking/garage for sale', '1 bed parking/garage for sale',
       '7 bed block of flats for sale', '5 bed cottage for sale',
       '4 bed cottage for sale', '16 bed flat for sale',
       '101 bed flat for sale', '6 bed houseboat for sale',
       '2 bed mobile/park home for sale', 'Room for sale',
       '1 bed cottage for sale', '12 bed flat for sale',
       '4 bed link-detached house for sale', '4 bed penthouse for sale',
       '5 bed link-detached house for sale', 'Detached house for sale',
       '15 bed semi-detached house for sale',
       '10 bed detached house for sale', '3 bed bungalow for sale',
       '4 bed semi-detached bungalow for sale',
       '3 bed semi-detached bungalow for sale',
       '4 bed detached bungalow for sale', '4 bed bungalow for sale',
       '5 bed semi-detached bungalow for sale', '9 bed property for sale',
       '5 bed detached bungalow for sale',
       '2 bed detached bungalow for sale',
       '6 bed detached bungalow for sale',
       '16 bed semi-detached house for sale',
       '2 bed semi-detached bungalow for sale',
       '2 bed terraced bungalow for sale',
       '1 bed block of flats for sale', '6 bed bungalow for sale',
       '6 bed semi-detached bungalow for sale',
       '2 bed shared accommodation for sale',
       '10 bed semi-detached house for sale',
       'End terrace house for sale', '170 bed property for sale',
       '10 bed block of flats for sale', '24 bed block of flats for sale',
       'Barn conversion for sale', '13 bed detached house for sale',
       '3 bed detached bungalow for sale',
       '1 bed terraced bungalow for sale',
       '3 bed mobile/park home for sale', 'Houseboat for sale',
       '21 bed detached house for sale', '5 bed bungalow for sale',
       '1 bed detached bungalow for sale', '1 bed penthouse for sale',
       'Semi-detached bungalow for sale',
       '11 bed terraced house for sale',
       '3 bed link-detached house for sale',
       '3 bed country house for sale', '1 bed mobile/park home for sale',
       '6 bed maisonette for sale', '3 bed equestrian property for sale',
       '3 bed shared accommodation for sale',
       '4 bed barn conversion for sale', '14 bed detached house for sale',
       '8 bed end terrace house for sale', '6 bed cottage for sale',
       '1 bed semi-detached bungalow for sale',
       '2 bed barn conversion for sale', '7 bed country house for sale',
       '2 bed link-detached house for sale', '10 bed property for sale',
       '6 bed link-detached house for sale',
       '8 bed detached bungalow for sale', '33 bed flat for sale',
       '7 bed link-detached house for sale', '13 bed property for sale',
       'Mobile/park home for sale', 'Flat for sale'], dtype=object)

Based on 'title' column the following categories can be extracted:
flat, studio, terraced house, detached house, semi-detached house, maisonette, land, mews house, town house, Parking/garage, property, houseboat, mobile/park etc...

I will use regular expressions to delete any unwanted words and then format the categories to lowercase

In [25]:
reg = re.compile(r'[0-9]+ bed\s|(end)\s|\sfor sale')
# reg.sub('', 'Semi-detached bungalow for sale').lower()
df['title'] = [reg.sub('', x).lower() for x in df['title']]

In [26]:
df['title'].unique()

array(['flat', 'studio', 'terraced house', 'property', 'parking/garage',
       'maisonette', 'semi-detached house', 'detached house',
       'terrace house', 'land', 'mews house', 'town house', 'cottage',
       'houseboat', 'mobile/park home', 'block of flats', 'penthouse',
       'bungalow', 'barn conversion', 'terraced bungalow', 'lodge',
       'room', 'link-detached house', 'semi-detached bungalow',
       'detached bungalow', 'shared accommodation', 'end terrace house',
       'country house', 'equestrian property'], dtype=object)

In [33]:
# the category 'property' is too vague, and 'terraced house' is the same as 'terrace house', that needs converting
filt = (df['title'] == 'terrace house')
df.loc[filt, 'title'] = 'terraced house'

In [34]:
df['title'].value_counts()

flat                      42912
terraced house             6834
semi-detached house        3638
maisonette                 2455
property                   2407
detached house             2024
studio                     1728
town house                  281
bungalow                    238
mews house                  167
detached bungalow           120
land                         99
semi-detached bungalow       93
houseboat                    76
cottage                      68
parking/garage               63
block of flats               60
link-detached house          47
mobile/park home             29
penthouse                    21
terraced bungalow             9
lodge                         5
barn conversion               5
room                          4
end terrace house             3
country house                 2
shared accommodation          2
equestrian property           1
Name: title, dtype: int64

In [32]:
# checking the distribution of number of bedrooms of flats
df.loc[df['title'] == 'flat', 'num_of_bed'].value_counts(normalize=True)
# at large, they consist of 1 and 2 bedrooms

2      0.501888
1      0.326016
3      0.148513
4      0.019319
5      0.003029
6      0.000606
7      0.000256
8      0.000093
11     0.000070
9      0.000070
13     0.000047
16     0.000023
12     0.000023
101    0.000023
33     0.000023
Name: num_of_bed, dtype: float64

In [35]:
df.loc[df['title'] == 'terraced house', 'num_of_bed'].value_counts(normalize=True)
#  most of the stock are 3-4 bedrooms

3     0.412496
4     0.268657
2     0.147644
5     0.113550
6     0.029997
1     0.015950
7     0.007755
8     0.001024
9     0.000878
60    0.000878
10    0.000585
12    0.000293
11    0.000146
13    0.000146
Name: num_of_bed, dtype: float64

In [37]:
#  given the above I will convert 'property' to 'flat' if bedrooms are 2 or less, and terraced house if more than 2 bedroom
# and to 'large house' with more than 8 bedrooms
filt1 = (df['title'] == 'property') & (df['num_of_bed'] <= 2)
df.loc[filt1, 'title'] = 'flat'
filt2 = (df['title'] == 'property') & (df['num_of_bed'] <= 8)
df.loc[filt2, 'title'] = 'terraced house'
filt3 = (df['title'] == 'property') & (df['num_of_bed'] > 8)
df.loc[filt3, 'title'] = 'large house'

In [38]:
df['title'].value_counts()

flat                      43724
terraced house             8412
semi-detached house        3638
maisonette                 2455
detached house             2024
studio                     1728
town house                  281
bungalow                    238
mews house                  167
detached bungalow           120
land                         99
semi-detached bungalow       93
houseboat                    76
cottage                      68
parking/garage               63
block of flats               60
link-detached house          47
mobile/park home             29
penthouse                    21
large house                  17
terraced bungalow             9
barn conversion               5
lodge                         5
room                          4
end terrace house             3
country house                 2
shared accommodation          2
equestrian property           1
Name: title, dtype: int64

# Assessing the downloaded datasets:
* extract data for main dataset for DS:
    * satisfaction index
    * happiness index
    * mean/median salary
    * crime rates
* note down which datasets can be used for Dashboard/Report

## Well being dataset

In [39]:
wb = pd.read_excel('./datasets/personal-well-being-borough.xlsx', sheet_name=1, header=[0, 1])

In [40]:
wb.dropna(subset=[(' ', 'Area')], axis=0, inplace=True)

In [41]:
wb.loc[:, (' ', 'Area')] = wb[' ']['Area'].str.lower()

In [42]:
wb.loc[:, ('Life Satisfaction','2018/19')] = wb['Life Satisfaction']['2018/19'].replace(np.nan, round(np.mean(wb['Life Satisfaction']['2018/19']), 2))

In [43]:
wb.loc[:, ('Happiness','2018/19')] = wb['Happiness']['2018/19'].replace('x', round(np.mean(wb['Life Satisfaction']['2018/19']), 2))

In [44]:
borough_set1 = set(df['borough'].unique())
borough_set2 = set(wb[' ']['Area'])
borough_set1.difference(borough_set2)

{'city of westminster'}

In [45]:
borough_set2

{'barking and dagenham',
 'barnet',
 'bexley',
 'brent',
 'bromley',
 'camden',
 'city of london',
 'croydon',
 'ealing',
 'east midlands',
 'east of england',
 'enfield',
 'england',
 'greenwich',
 'hackney',
 'hammersmith and fulham',
 'haringey',
 'harrow',
 'havering',
 'hillingdon',
 'hounslow',
 'islington',
 'kensington and chelsea',
 'kingston upon thames',
 'lambeth',
 'lewisham',
 'london',
 'merton',
 'newham',
 'north east',
 'north west',
 'northern ireland',
 'redbridge',
 'richmond upon thames',
 'scotland',
 'south east',
 'south west',
 'southwark',
 'sutton',
 'tower hamlets',
 'uk',
 'wales',
 'waltham forest',
 'wandsworth',
 'west midlands',
 'westminster',
 'yorkshire and the humber'}

In [46]:
wb.loc[wb[' ']['Area'] == 'westminster', (' ', 'Area')] = 'city of westminster'

In [47]:
df['satisfaction'] = [wb.loc[wb[' ']['Area'] == x, 'Life Satisfaction']['2018/19'].values[0] for x in df['borough']]

In [48]:
df['happiness'] = [wb.loc[wb[' ']['Area'] == x, 'Happiness']['2018/19'].values[0] for x in df['borough']]

## Crime rates dataset

In [49]:
cr = pd.read_csv('./datasets/housing_in_london_monthly_variables.csv')
cr.head()

,date,area,average_price,code,houses_sold,no_of_crimes,borough_flag
0,1/1/1995,city of london,91449,E09000001,17.0,NaN,1
1,2/1/1995,city of london,82203,E09000001,7.0,NaN,1
2,3/1/1995,city of london,79121,E09000001,14.0,NaN,1
3,4/1/1995,city of london,77101,E09000001,7.0,NaN,1
4,5/1/1995,city of london,84409,E09000001,10.0,NaN,1

In [50]:
cr.dtypes

date              object
area              object
average_price      int64
code              object
houses_sold      float64
no_of_crimes     float64
borough_flag       int64
dtype: object

In [51]:
cr['date'] = [x.split('/')[-1] for x in cr['date']]

In [52]:
group = cr.groupby(['date'])
rates_2020 = group.get_group('2020')

In [53]:
borough_set = set(rates_2020['area'])
borough_set1.difference(borough_set2)

{'city of westminster'}

In [54]:
borough_set2

{'barking and dagenham',
 'barnet',
 'bexley',
 'brent',
 'bromley',
 'camden',
 'city of london',
 'croydon',
 'ealing',
 'east midlands',
 'east of england',
 'enfield',
 'england',
 'greenwich',
 'hackney',
 'hammersmith and fulham',
 'haringey',
 'harrow',
 'havering',
 'hillingdon',
 'hounslow',
 'islington',
 'kensington and chelsea',
 'kingston upon thames',
 'lambeth',
 'lewisham',
 'london',
 'merton',
 'newham',
 'north east',
 'north west',
 'northern ireland',
 'redbridge',
 'richmond upon thames',
 'scotland',
 'south east',
 'south west',
 'southwark',
 'sutton',
 'tower hamlets',
 'uk',
 'wales',
 'waltham forest',
 'wandsworth',
 'west midlands',
 'westminster',
 'yorkshire and the humber'}

In [55]:
rates_2020.loc[rates_2020['area'] == 'westminster', 'area'] = 'city of westminster'

/Users/robertczikkel/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1765: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value)

In [56]:
df['crime rate'] = [rates_2020.loc[rates_2020['area'] == x, 'no_of_crimes'].values[0] for x in df['borough']]

# Median salary dataset

In [57]:
ms = pd.read_csv('./datasets/housing_in_london_yearly_variables.csv')

In [58]:
ms.tail()

,code,area,date,median_salary,life_satisfaction,mean_salary,recycling_pct,population_size,number_of_jobs,area_size,no_of_houses,borough_flag
1066,K03000001,great britain,12/1/2019,30446.0,NaN,37603,NaN,NaN,NaN,NaN,NaN,0
1067,K04000001,england and wales,12/1/2019,30500.0,NaN,37865,NaN,NaN,NaN,NaN,NaN,0
1068,N92000002,northern ireland,12/1/2019,27434.0,NaN,32083,NaN,NaN,NaN,NaN,NaN,0
1069,S92000003,scotland,12/1/2019,30000.0,NaN,34916,NaN,NaN,NaN,NaN,NaN,0
1070,W92000004,wales,12/1/2019,27500.0,NaN,31251,NaN,NaN,NaN,NaN,NaN,0

In [59]:
ms['date'] = [x.split('/')[-1] for x in ms['date']]

In [60]:
ms_group = ms.groupby(['date'])
ms_2020 = ms_group.get_group('2019')
ms_2020.loc[ms_2020['area'] == 'westminster', 'area'] = 'city of westminster'

/Users/robertczikkel/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1765: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value)

In [61]:
df['median salary'] = [ms_2020.loc[ms_2020['area'] == x, 'median_salary'].values[0] for x in df['borough']]

In [62]:
df.dtypes

borough                 object
id                      object
address                 object
title                   object
num_of_bed               int64
num_of_bath              int64
reception_room           int64
transport_primary       object
station1_dist(mi)      float64
transport_secondary     object
station2_dist(mi)      float64
tag                     object
parking                  int64
price                    int64
date                    object
satisfaction           float64
happiness              float64
crime rate             float64
median salary          float64
dtype: object

# Geocoordinates from 'address' and 'borough' columns

In [63]:
from geopy.geocoders import Nominatim
geolocator = Nominatim(user_agent="robert.czikkel@gmail.com")

In [64]:
borough_list = list(borough_set1)
borough_list
lat = []
lon = []
for borough in borough_list:
    location = geolocator.geocode(borough)
    lat.append(location.latitude)
    lon.append(location.longitude)
    
geo_coord = pd.DataFrame({
    'borough': borough_list,
    'lat': lat,
    'lon': lon
})

In [65]:
df['lat'] = [geo_coord.loc[geo_coord['borough'] == x, 'lat'].values[0] for x in df['borough']]

In [66]:
df['lon'] = [geo_coord.loc[geo_coord['borough'] == x, 'lon'].values[0] for x in df['borough']]

In [67]:
df.head()

,borough,id,address,title,num_of_bed,num_of_bath,reception_room,transport_primary,station1_dist(mi),transport_secondary,...,tag,parking,price,date,satisfaction,happiness,crime rate,median salary,lat,lon
0,city of london,listing_58614319,"One Crown Place, 54 Wilson Street EC2A",flat,1,1,0,national_rail_station,0.2,london_underground_station,...,New home,0,1030000,2021-07-07,7.63,7.63,4576.0,61636.0,51.515618,-0.091998
1,city of london,listing_58614075,"The Barbican, Barbican, London EC2Y",flat,1,1,1,london_underground_station,0.2,national_rail_station,...,New home,0,725000,2021-07-07,7.63,7.63,4576.0,61636.0,51.515618,-0.091998
2,city of london,listing_52061413,"Principal Tower, Worship Lane, Shoreditch EC2A",flat,1,1,1,national_rail_station,0.2,national_rail_station,...,New home,0,875000,2021-07-07,7.63,7.63,4576.0,61636.0,51.515618,-0.091998
3,city of london,listing_55657629,"One Crown Place, Hackney EC2A",flat,2,2,0,national_rail_station,0.2,london_underground_station,...,New home,0,1750000,2021-07-07,7.63,7.63,4576.0,61636.0,51.515618,-0.091998
4,city of london,listing_58592857,"Barbican, London EC2Y",studio,1,1,1,london_underground_station,0.0,national_rail_station,...,New home,0,535000,2021-07-07,7.63,7.63,4576.0,61636.0,51.515618,-0.091998

In [68]:
# double-checking column names for sql
df.columns

Index(['borough', 'id', 'address', 'title', 'num_of_bed', 'num_of_bath',
       'reception_room', 'transport_primary', 'station1_dist(mi)',
       'transport_secondary', 'station2_dist(mi)', 'tag', 'parking', 'price',
       'date', 'satisfaction', 'happiness', 'crime rate', 'median salary',
       'lat', 'lon'],
      dtype='object')

In [69]:
# deleting column names with () to avoid errors with sql 
df['station1_dist'] = df['station1_dist(mi)']
df['station2_dist'] = df['station2_dist(mi)']

In [70]:
del df['station1_dist(mi)']

In [71]:
del df['station2_dist(mi)']

# Saving dataset to csv and PostGreSQL database

In [73]:
import psycopg2
from sqlalchemy import create_engine

In [74]:
engine = create_engine('postgresql://postgres:G00dvibes04@localhost:5432/ldn_properties')

In [75]:
df.to_sql('properties_new', engine, if_exists='replace')

In [142]:
geo_coord.to_sql('geocoordinates', engine)

In [76]:
df.to_csv('properties_new.csv')

In [144]:
geo_coord.to_csv('geo_coords.csv')